Revit 2027 API
ParameterTypeId.StairsRailingRailOffset Property
 "Rail Offset"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId StairsRailingRailOffset { get; }
Public Shared ReadOnly Property StairsRailingRailOffset As ForgeTypeId
	Get
public:
static property ForgeTypeId^ StairsRailingRailOffset {
	ForgeTypeId^ get ();
}
static member StairsRailingRailOffset : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace